cases/ansys_verification/VMFL034-R3/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: v2606  VMFL034-R2                      |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// VMFL034-R2 -- constant-kernel aggregation in a CMSMPR box.
//   phase 'air'   = the DISPERSED, AGGREGATING PARTICLE PHASE (velocityGroup +
//                   sectional sizeGroups). Name inherited from the template
//                   (PREREGISTRATION s.D.1 disclosure: no air, no bubbles here).
//   phase 'water' = continuous carrier (rho=998.2, mu=0.00103 via thermo);
//                   constant drag diameter 1e-5 m (flow decoupled by construction;
//                   single shared dispersed velocity via velocityGroup).
// Sectional grid is NOMINAL O(1) (Ruling 4), geometric d in [0.45, 22.0].
// THIS INSTANCE: 32 size groups -- one level of the r=2 (N_g/2N_g/4N_g)
//   section-7 triple 16/32/64. The sizeGroups list below is emitted by the PINNED
//   generator gen_sizegroups.py (Wheeler quadrature + Kumar-Ramkrishna fixed pivot)
//   from the frozen archive feed moments; it is FROZEN material, not synthesised at
//   grade time.
// coalescenceModels: constant rate 2000 [m3/s] = beta0_OF = Da/(alpha2*tau) =
//   100/(1e-2*5) at the RESCALED tau=5 s (PREREGISTRATION s.C.A/RULING A).

type            populationBalanceTwoPhaseSystem;

phases          (air water);

populationBalances (bubbles);

air
{
    type            purePhaseModel;
    diameterModel   velocityGroup;
    velocityGroupCoeffs
    {
        populationBalance    bubbles;

        formFactor      0.5235987756;   // pi/6, spheres

        sizeGroups
        (
            f0{d 4.50000000e-01; value 0.0;}
            f1{d 5.10156194e-01; value 0.01587274396;}
            f2{d 5.78354095e-01; value 5.506852461e-05;}
            f3{d 6.55668720e-01; value 0.0;}
            f4{d 7.43318798e-01; value 0.0;}
            f5{d 8.42685976e-01; value 0.0;}
            f6{d 9.55336602e-01; value 0.0;}
            f7{d 1.08304641e+00; value 0.2183116101;}
            f8{d 1.22782852e+00; value 0.2911969412;}
            f9{d 1.39196517e+00; value 0.0;}
            f10{d 1.57804368e+00; value 0.0;}
            f11{d 1.78899724e+00; value 0.3227629439;}
            f12{d 2.02815116e+00; value 0.1518006923;}
            f13{d 2.29927528e+00; value 0.0;}
            f14{d 2.60664340e+00; value 0.0;}
            f15{d 2.95510061e+00; value 0.0;}
            f16{d 3.35013974e+00; value 0.0;}
            f17{d 3.79798787e+00; value 0.0;}
            f18{d 4.30570453e+00; value 0.0;}
            f19{d 4.88129297e+00; value 0.0;}
            f20{d 5.53382632e+00; value 0.0;}
            f21{d 6.27359062e+00; value 0.0;}
            f22{d 7.11224692e+00; value 0.0;}
            f23{d 8.06301516e+00; value 0.0;}
            f24{d 9.14088251e+00; value 0.0;}
            f25{d 1.03628396e+01; value 0.0;}
            f26{d 1.17481485e+01; value 0.0;}
            f27{d 1.33186461e+01; value 0.0;}
            f28{d 1.50990884e+01; value 0.0;}
            f29{d 1.71175411e+01; value 0.0;}
            f30{d 1.94058214e+01; value 0.0;}
            f31{d 2.20000000e+01; value 0.0;}
        );
    }

    residualAlpha   1e-6;
}

water
{
    type            purePhaseModel;
    diameterModel   constant;
    constantCoeffs
    {
        d               1e-5;   // Ruling 3: constant drag diameter, flow decoupled
    }

    residualAlpha   1e-6;
}

populationBalanceCoeffs
{
    bubbles
    {
        continuousPhase water;

        coalescenceModels
        (
            constant
            {
                rate    rate [0 3 -1 0 0 0 0] 2000;
            }
        );

        binaryBreakupModels
        ();

        breakupModels
        ();

        driftModels
        ();

        nucleationModels
        ();
    }
}

blending
{
    default
    {
        type            linear;
        minFullyContinuousAlpha.air 0.7;
        minPartlyContinuousAlpha.air 0.3;
        minFullyContinuousAlpha.water 0.7;
        minPartlyContinuousAlpha.water 0.3;
    }

    drag
    {
        type            linear;
        minFullyContinuousAlpha.air 0.7;
        minPartlyContinuousAlpha.air 0.5;
        minFullyContinuousAlpha.water 0.7;
        minPartlyContinuousAlpha.water 0.5;
    }
}

surfaceTension
(
    (air and water)
    {
        type            constant;
        sigma           0.07;
    }
);

aspectRatio
(
    (air in water)
    {
        type            constant;
        E0              1.0;
    }

    (water in air)
    {
        type            constant;
        E0              1.0;
    }
);

drag
(
    (air in water)
    {
        type            SchillerNaumann;
        residualRe      1e-3;
        swarmCorrection
        {
            type        none;
        }
    }

    (water in air)
    {
        type            SchillerNaumann;
        residualRe      1e-3;
        swarmCorrection
        {
            type        none;
        }
    }

    (air and water)
    {
        type            segregated;
        m               0.5;
        n               8;
        swarmCorrection
        {
            type        none;
        }
    }
);

virtualMass
(
    (air in water)
    {
        type            constantCoefficient;
        Cvm             0.5;
    }

    (water in air)
    {
        type            constantCoefficient;
        Cvm             0.5;
    }
);

heatTransfer
(
    (air in water)
    {
        type            RanzMarshall;
        residualAlpha   1e-4;
    }

    (water in air)
    {
        type            RanzMarshall;
        residualAlpha   1e-4;
    }
);

phaseTransfer
(
);

lift
(
);

wallLubrication
(
);

turbulentDispersion
(
);

pMin            10000;


// ************************************************************************* //
